OpenFOAM-13/tutorials/fluid/hotRoomComfort/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

age
{
    libs            ("libfieldFunctionObjects.so");
    type            age;

    diffusion       on;

    writeControl    writeTime;
    executeControl  writeTime;
}

comfort
{
    libs            ("libfieldFunctionObjects.so");
    type            comfort;

    clothing        0.5;
    metabolicRate   1.2;
    extWork         0;
    relHumidity     60;

    writeControl    writeTime;
    executeControl  writeTime;
}

// ************************************************************************* //
